"""A basic script for clustering news based on bag-of-words.

Averages fastText embeddings of all news articles and performs DBSCAN
clustering. Here is an example result with the current parameters.

{-1: [],
 0: ['Երբ ինձ ուղարկում եք Արցախի հարցը լուծելու, ինչու չեք ասում՝ կգնաս եւ '
     'հարցը կլուծես այսպես. Փաշինյան',
     'Չունենք հայեցակարգ՝ ինչպես ենք ուզում լուծվի Ղարաբաղի հարցը. երբ ինձ '
     'ուղարկում եք բանակցելու, չեք ասում՝ կգնաս ու հարցը այսպես կլուծես. Նիկոլ '
     'Փաշինյան'],
 1: ['Շրի Լանկայի ոստիկանությունը տասնյակ դետոնատորներ է հայտնաբերել ավտոբուսի '
     'կանգառում',
     'Շրի Լանկայի ոստիկանությունը 87 ճայթիչ է հայտնաբերել Կոլոմբոյի ավտոբուսի '
     'կայարանում'],
 2: ['Հանրապետության որոշ շրջաններում ձյուն է տեղում, Սարավանի լեռնանցքում '
     'գետնաբուք է',
     'Հանրապետության որոշ շրջաններում ձյուն է տեղում, Սարավանի լեռնանցքում '
     'գետնաբուք է'],
 3: ['Համալիր ստուգումներ են իրականացվել հրետանային զորամասում',
     'Հրետանային ստորաբաժանումները մարտական տագնապով դուրս են բերվել '
     'զորավարժարան',
     'ՀՀ ԶՈՒ հրետանային զորամասում համալիր ստուգումներ են անցկացվել'],
 4: ['Նավթի գները բարձրանում են', 'Նավթի գները բարձրանում են'],
 5: ['Երկար ժամանակով լույս չի լինելու Երեւանում եւ 6 մարզերում',
     'Երկար ժամանակով լույս չի լինելու Երեւանում եւ 7 մարզերում',
     'Երկար ժամանակով լույս չի լինելու Երեւանում եւ 5 մարզերում'],
 6: ['Արմավիր քաղաքի բնակարաններից մեկում հայտնաբերվել է բնակչի դին',
     'Արմավիր քաղաքի բնակարաններից մեկում հայտնաբերվել է բնակչի դին',
     'Արմավիր քաղաքի բնակարաններից մեկում դի է հայտնաբերվել'],
 7: ['Դանիայի ամենահարուստ մարդու 3 երեխաները զոհվել են Շրի Լանկայում 290 '
     'մարդու կյանք խլած ահաբեկչության հետևանքով (լուսանկարներ)',
     'Շրի Լանկայում ահաբեկչության հետևանքով 3 երեխաներին կորցրած միլիարդատերը '
     'պատրաստվում էր Շոտլանդիայի կալվածքները նրանց փոխանցել (լուսանկարներ)'],
 8: ['Ապրիլի 24-ին Ծիծեռնակաբերդի հուշահամալիր այցելողների համար կգործեն '
     'անվճար տրանսպորտային երթուղիներ',
     'Ապրիլի 24-ին Ծիծեռնակաբերդի հուշահամալիր այցելողների համար կգործեն '
     'անվճար տրանսպորտային երթուղիներ',
     'Ապրիլի 24-ին Ծիծեռնակաբերդ այցելողներին կտեղափոխեն անվճար'],
 9: ['Դանակահարություն Ծարավ Աղբյուրի փողոցում. հարվածը եղել է սրտի մոտ',
     'Հրազենային վնասվածք գերեզմանատան մոտ. 22-ամյա Ռոմանը կրակել է տղամարդու '
     'ազդրերին'],
 10: ['Նիկոլ Փաշինյանը խորհրդակցություն է անցկացրել մարզպետների հետ. նրանց '
      'հանձնարարականներ են տրվել',
      'Վարչապետը խորհրդակցություն է անցկացրել. Մարզպետները զեկուցել են '
      'սուբվենցիոն ծրագրերի ընթացքի մասին'],
 11: ['Հայտնի է դարձել Շրի Լանկայի պայթյունների համար կասկածվող ահաբեկչական '
      'խմբավորման անունը',
      'ԻՊ-ը ստանձնել է Շրի Լանկայում 321 մարդու մահվան պատճառ դարձած '
      'ահաբեկչությունների պատասխանատվությունը'],
 12: ['«ՏՏ ոլորոտում Հայաստանը դեռ շատ ասելիք ունի». ԱԳ նախարարը ծանոթացել է  '
      '«Ինժեներական քաղաքի» կոնցեպտին',
      'Հայաստանը դեռ շատ ասելիք ունի ՏՏ ոլորտում. Զոհրաբ Մնացականյանն այցելել '
      'է «Ինժեներական քաղաք»'],
 13: ['Թուրքիան քննադատել է իրանական նավթի հարցով ԱՄՆ-ի որոշումը',
      'Իրանական նավթի արտահանումը զրոյացնելու ԱՄՆ-ի ծրագիրը երազանք է'],
 14: ['Օրվա գլխավոր լուրերը՝ «մեկ տողով»․ 22․04․2019',
      'Օրվա գլխավոր լուրերը՝ «մեկ տողով»․ 23․04․2019',
      'Օրվա գլխավոր լուրերը՝ «մեկ տողով»․ 24․04․2019'],
 15: ['«168 ժամ». Արամ Սիմոնյանի դեմ նոր գրոհ է կազմակերպվում',
      '«168 ժամ». Արամ Սիմոնյանի դեմ նոր գրոհ է կազմակերպվում'],
 16: ['Շրի Լանկայում պայթյունների հետեւանքով զոհերի թիվը հասել է 310-ի',
      'Շրի Լանկայում զոհերի թիվը հասել է 310-ի',
      'Շրի Լանկայում պայթյունների հետեւանքով զոհերի թիվը հասել է մինչեւ 359-ի',
      'Շրի Լանկայում զոհերի թիվը հասել է 360-ի'],
 17: ['Երևանում մեքենան բախվել է գետնանցումի պատին. վարորդն ու 2 ուղևորները '
      'հոսպիտալացվել են',
      'Երեւանում մեքենան բախվել է գետնանցումի պատին. վարորդն ու 2 ուղեւորները '
      'հիվանդանոցում են'],
 18: ['Ինչպե՞ս\xa0գրանցել ՍՊԸ և\xa0ի՞նչ խախտումների դեպքում դիմել Մարդու '
      'իրավունքների պաշտպանին․\xa0իրազեկող տեսանյութ',
      'Ինչպե՞ս գրանցել ՍՊԸ եւ ի՞նչ խախտումների դեպքում դիմել Մարդու '
      'իրավունքների պաշտպանին․ իրազեկող տեսանյութ'],
 19: ['Ջահերով երթը կմեկնարկի Ազատության հրապարակից',
      'Ջահերով երթը կմեկնարկի Ազատության հրապարակից'],
 20: ['Քարաթափման հետեւանքով Կապան-Քաջարան ճանապարհը միակողմանի փակվել է',
      'Քարաթափման հետևանքով Կապան-Քաջարան ճանապարհահատվածը միակողմանի փակվել '
      'է'],
 21: ['Նազարբաևը թեկնածու է առաջադրել Ղազախստանի նախագահի պաշտոնի համար',
      'Նազարբաևն առաջարկել է Տոկաևին առաջադրել Ղազախստանի նախագահի պաշտոնում'],
 22: ['Գիտնականները Գրենլանդիայում սառույցների հալքի տեմպերի աճ են գրանցել',
      'Գիտնականները Գրենլանդիայի սառույցների հալվելու տեմպի աճ են արձանագրել'],
 23: ['2018 թ. ՔԿ-ում քննվել է կոռուպցիոն բնույթի հանցագործությունների դեպքերի '
      'առթիվ հարուցված 1233 քրեական գործ. ամփոփում',
      '2018թ. ընթացքում Քննչական կոմիտեում քննվել է կոռուպցիոն բնույթի '
      'հանցագործություններով հարուցված 1.233 քրեական գործ'],
 24: ['Ամբողջ անձնակազմը եռամսյակային պարգևավճարներ կստանա, բացի քաղաքապետից. '
      'Հայկ Մարության',
      'Քաղաքապետարանի ամբողջ անձնակազմը եռամսյակային պարգեւավճարներ կստանա, '
      'բացի քաղաքապետից. Մարության'],
 25: ['Երիտասարդական քայլերթ Նիկոսիայում՝ ի հիշատակ Հայոց ցեղասպանության '
      'զոհերի',
      'Հաղթական կամարի կրակի նորացման արարողություն Փարիզում՝ ի հիշատակ Հայոց '
      'ցեղասպանության զոհերի'],
 26: ['«Ապե՛ր,\xa0հլը\xa0դուրս\xa0արի».\xa0երկար\xa0նայելու\xa0համար\xa0'
      'ավագանու ԲՀԿ խմբակցության անդամը\xa0«Իմ\xa0քայլի»\xa0անդամին դուրս '
      'հրավիրեց',
      '«Ապե՛, հլը դուրս արի». երկար նայելու համար ավագանու ԲՀԿ-ականը դուրս '
      'հրավիրեց «Իմ քայլի» անդամին'],
 27: ['Չեխիայի խորհրդարանը վավերացրել է ՀՀ-ԵՄ համաձայնագիրը',
      'Չեխիայի խորհրդարանի Պատգամավորների պալատը վավերացրել է ՀՀ-ԵՄ '
      'համաձայնագիրը'],
 28: ['Tesla-ն մտադիր է 2020 թվականին անվարորդ տաքսի ծառայություն թողարկել',
      'Tesla-ն նախատեսում է 2020 թվականին գործարկել անվարորդ տաքսիների '
      'ծառայություն'],
 29: ['Ապրիլի 24-ին «Սանիթեքը» կաշխատի 24-ժամյա ռեժիմով',
      'Ապրիլի 24-ին «Սանիթեքը» կաշխատի 24-ժամյա ռեժիմով'],
 30: ['Դատախազությունը ՌԴ իրավապահ մարմիններին է ներկայացրել Միհրան Պողոսյանին '
      'ՀՀ իրավասու մարմիններին հանձնելու համար անհրաժեշտ փաստաթղթերի փաթեթը',
      'Դատախազությունը ՌԴ իրավապահներին  ներկայացրել է Միհրան Պողոսյանի '
      'արտահանձնման համար անհրաժեշտ փաստաթղթերը'],
 31: ['Թրամփը The New York Times-ից պահանջել է իրենից ծնկաչոք ներողություն '
      'խնդրել',
      'Թրամփը The New York Times-ից պահանջել է ծնկաչոք ներողություն խնդրել '
      'իրենից'],
 32: ['Հայաստան ինքնակամ վերադարձող միգրանտների թիվը կտրուկ աճել է, բայց նրանք '
      'վերաինտեգրման խնդիր ունեն. Բաթոյան',
      'ՀՀ ինքնակամ վերադարձող միգրանտների թիվը կտրուկ աճել է, բայց նրանք '
      'վերաինտեգրման խնդիր ունեն. հանդիպում Սոցապ նախարարությունում'],
 33: ['Վթարի հետևանքով Գեղարքունիքի մարզի մի շարք բնակավայրեր զրկվել են '
      'հեռուստատեսային և ռադիոալիքների ընդունման հնարավորությունից',
      'Վթարի հետևանքով Գեղարքունիքի մի շարք բնակավայրեր զրկվել են հեռուստա և '
      'ռադիոալիքների ընդունման հնարավորությունից'],
 34: ['Ռուսական դատարանը բավարարել է Միհրան Պողոսյանին 40 օրով կալանավորելու '
      'միջնորդությունը',
      'ՌԴ դատարանը բավարարել է Միհրան Պողոսյանին 40 օրով կալանավորելու '
      'միջնորդությունը'],
 35: ['Տիգրան Ավինյանը ներկայացրել է Հանրային ծառայությունները կարգավորող '
      'հանձնաժողովի նորընտիր նախագահին',
      'Տիգրան Ավինյանը ներկայացրել է ՏՄՊՊՀ նորընտիր նախագահին',
      'Տիգրան Ավինյանը ներկայացրել է ՏՄՊՊՀ նորընտիր նախագահին'],
 36: ['Հայոց ցեղասպանության 104-րդ տարելիցն է',
      'Այսօր լրանում է Հայոց ցեղասպանության 104-րդ տարելիցը',
      'Հայոց ցեղասպանության 104-րդ տարելիցն է'],
 37: ['«Տոտենհեմը» խաղավերջին խփած գեղեցիկ գոլի շնորհիվ հաղթեց «Բրայթոնին»',
      '«Բարսելոնան» հյուրընկալվելիս հաղթեց «Ալավեսին»'],
 38: ['Կիմ Չեն Ընը զրահապատ գնացքով մեկնել է Ռուսաստան',
      'Կիմ Չեն Ինը Ռուսաստան է ժամանել'],
 39: ['«Փաստ». Որքանո՞վ են ավելացել ԶՈՒ գլխավոր շտաբի պետի դրամական միջոցները',
      '«Փաստ». Որքանո՞վ են ավելացել ՀՀ ԶՈՒ գլխավոր շտաբի պետի դրամական '
      'միջոցները'],
 40: ['Ծիծեռնակաբերդում այսօր կգործի Հայկական Կարմիր խաչի ընկերության Առաջին '
      'օգնության տաղավարը',
      'Ծիծեռնակաբերդում կգործի Կարմիր խաչի առաջին օգնության տաղավարը'],
 41: ['Հայոց ցեղասպանության միջազգային ճանաչման վերջնական հանգրվանը '
      'հայրենատիրությունն է. «Ժառանգություն»',
      'Թուրքիան քննարկում է Հայոց ցեղասպանության ճանաչման գործընթացը '
      '«համահայկական դավադրության» տեսանկյունից. Սատանովկսի'],
 42: ['Երկրաշարժ՝ Արցախում. ցնցման ուժգնությունն էպիկենտրոնում կազմել է 4 բալ',
      'Երկրաշարժ՝ Արցախում. ցնցման ուժգնությունն էպիկենտրոնում կազմել է 4 բալ'],
 43: ['Վարչապետ. Հետևողական ենք լինելու Ցեղասպանության միջազգային ճանաչման '
      'գործում',
      'Հետեւողական ենք լինելու Հայոց ցեղասպանության միջազգային ճանաչման '
      'գործում. Փաշինյանի ուղերձը'],
 44: ['Բակո Սահակյանը ծաղիկներ է դրել Ստեփանակերտում Մեծ եղեռնի անմեղ զոհերի '
      'հիշատակը հավերժացնող հուշակոթողին',
      'Բակո Սահակյանը ծաղիկներ է դրել Մեծ եղեռնի անմեղ զոհերի հիշատակը '
      'հավերժացնող հուշակոթողին'],
 45: ['Նիկոլ Աղբալյանի անվան դպրոցում աշակերտնեը ծեծել են միմյանց. '
      'shamshyan.com',
      'Արտակարգ դեպք Ն.Աղբալյանի անվան դպրոցում. ութ աշակերտ ծեծի են ենթարկել '
      'երկու աշակերտի'],
 46: ['Հայտարարվել են «Ավրորայի» 2019 թվականի հերոսները',
      '2019-ի «Ավրորայի» հերոսները հայտնի են'],
 47: ['Մահացել է «Հայաստանի Հանրապետություն» օրաթերթի գլխավոր խմբագիր Տիգրան '
      'Ֆարմանյանը',
      'Վախճանվել է «Հայաստանի Հանրապետություն» օրաթերթի գլխավոր խմբագիր Տիգրան '
      'Ֆարմանյանը'],
 48: ['Միհրան Պողոսյանը քաղապաստան է խնդրել ՌԴ-ից',
      'Միհրան Պողոսյանը քաղաքական ապաստան է խնդրել Ռուսաստանից'],
 49: ['Նիկոլ Փաշինյանն ու Աննա Հակոբյանը ծանոթացել են «Հայոց ցեղասպանության '
      '150-ամյա վկաները» խորագրով ցուցադրությանը',
      'Նիկոլ Փաշինյանն ու Աննա Հակոբյանը ծանոթացել են «Հայոց ցեղասպանության '
      '150-ամյա վկաները» խորագրով ցուցադրությանը'],
 50: ['Արթիկում գտնվող չշահագործվող պահեստում հրդեհ է բռնկվել (լուսանկարներ)',
      'Արթիկի չշահագործվող պահեստում խոշոր հրդեհ է բռնկվել (ֆոտո)']}
"""

import os
import pprint

import gensim.models
import numpy as np
import sklearn.cluster

import allnews_am.db
import allnews_am.processing


file_dir = os.path.dirname(os.path.realpath(__file__))
emb_model = gensim.models.fasttext.FastText.load(
    os.path.join(file_dir, '../models/fastText_sg_100.model'))


def bag_of_words(s):
    vec = np.zeros((emb_model.wv.vector_size,))
    i = 0
    for sentence in allnews_am.processing.tokenize(s):
        for token in sentence:
            vec += emb_model.wv[token]
            i += 1
    return vec/i if i else vec


def feature_matrix(articles):
    fm = np.zeros((len(articles), emb_model.wv.vector_size))
    for i, (title, text) in enumerate(articles):
        title_vec = bag_of_words(title)
        text_vec = bag_of_words(text)
        fm[i, :] = title_vec + text_vec
    return fm


def main():
    mydb = allnews_am.db.MySQL()
    some_news = mydb.fetch_news(limit=1000)
    fm = feature_matrix(some_news)
    dbscan = sklearn.cluster.DBSCAN(
        eps=0.04, min_samples=2, metric='cosine')
    clusters = dbscan.fit_predict(fm)
    groups = {gi: [] for gi in set(clusters)}
    for news_index, news_cluster in enumerate(clusters):
        if news_cluster != -1:  # News without a cluster
            groups[news_cluster].append(some_news[news_index][0])
    pprint.pprint(groups)


if __name__ == '__main__':
    main()
